# file : menu.py


def show_menu():
    '''显示菜单'''
    print("+---------------------------------+")
    print("| 1) 添加学生信息                 |")
    print("| 2) 显示学生信息                 |")
    print("| 3) 删除学生信息                 |")
    print("| 4) 修改学生成绩                 |")
    print("| 5) 按学生成绩高-低显示学生信息  |")
    print("| 6) 按学生成绩低-高显示学生信息  |")
    print("| 7) 按学生年龄高-低显示学生信息  |")
    print("| 8) 按学生年龄低-高显示学生信息  |")
    print("| 9) 从文件中读取学生数据(si.txt) |")
    print("| 10) 保存信息到文件(si.txt)      |")
    print("| q) 退出                         |")
    print("+---------------------------------+")

